<template>
   <div>
    <div className="mainPage">
        <h1>{{title}}</h1>
    </div>
    <h2>Что мы едим?</h2>  
    <p>Не удивляйтесь! От ответа на этот, казалось бы, "детский" вопрос напрямую зависит состояние нашего здоровья и самочувствие. В сложившихся современных условиях многие "продукты питания", даже с "большой натяжкой", сложно назвать пищей, т.к. никакой пищевой и биологической ценности для организма человека такая "еда" не представляет, но одновременно создаёт немало проблем для его полноценной работы.</p>
    <p>Дело в том, что современный человек с некоторых пор стал не совсем адекватно относиться к тем продуктам, которые ежедневно употребляет в пищу, да и к самому процессу питания вообще. Это касается не только производителей, но и нас - потребителей этих "высокотехнологичных продуктов", в полной мере!</p>
    <p>Мы часто - в силу многих причин - упускаем из виду тот немаловажный факт, что предназначение пищи, в сущности, одно. И заключается оно в снабжении организма всеми необходимыми для его полноценного функционирования веществами. Всё остальное - лишь "довесочки".</p>
    <p>Организм человека - сложная биологическая система, которая ни на секунду не прекращает свою работу. Для того, чтобы поддерживать эту систему в "рабочем состоянии" организму человека приходится выполнять огромный "комплекс работ", требующий большого количества "расходных материалов" - биологически активных компонентов - витаминов, минеральных веществ, аминокислот, жиров, простых и сложных углеводов, гормонов и гормоноподобных соединений и пр. Большинство из этих, необходимых ему для полноценной жизнедеятельности веществ, наш организм синтезировать не может, он привык получать их с пищей.</p>
  </div>  
</template>

<script>
  export default {
    name: 'Main',
    data () {
      return {
        title: 'this is Main page'
      }
    }
  }
</script>

<style scoped>
  .mainPage{
    width : 40%;
    min-width: 200px;
    float: left;
    user-select: none;
    background-color: #ccc;
    padding: 10px;
    margin-right: 10px; 
    box-shadow: 0 0 11px rgba(0, 0, 0, 1);
    border-radius: 20px;
    img {
        max-width: 100%;
    }
}
</style>

